Revit 2026 API

# ColumnAttachmentIsValidColumn Method

---

Says whether a FamilyInstance supports column attachments.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsValidColumn(
	FamilyInstance familyInstance
)
```
```vb
Public Shared Function IsValidColumn (
	familyInstance As FamilyInstance
) As Boolean
```
```cpp
public:
static bool IsValidColumn(
	FamilyInstance^ familyInstance
)
```
```fsharp
static member IsValidColumn :
        familyInstance : FamilyInstance -> bool
```

#### Parameters

familyInstance FamilyInstance
     A column.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

In-place columns do not support attachments.

#### Reference

ColumnAttachment Class

Autodesk.Revit.DB Namespace